{
  "education": [
    {
      "awards_achievements": [
        "Admission Scholarship - Achieved at least 90% average in High School"
      ],
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science \u0026 Mathematics",
      "duration": "2017-2021",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_demo",
  "highlighted_projects": [
    {
      "description": "This is a typical Connect Four game. My team and I developed this game using Python with the Pygame library. This game is strictly for 2 players where each player takes turns with the same goal of connecting 4 chips consecutively in any direction.",
      "git_url": "https://github.com/osamaramihafez/c4",
      "name": "C4 (Connect Four)"
    },
    {
      "description": "A trivia game that was developed as a team using Java with the Eclipse IDE. The player needs to create an account in order to have access. This game allows the player to create and play different quizzes for any topic.",
      "git_url": "https://github.com/thelilyliu/reach",
      "name": "Reach Trivia"
    },
    {
      "description": "This is a Flappy Bird parody game. This game was developed by my friend and I using Java. This is my first ever side project. The goal of this game is to get as far as you can without hitting the pipes coming your way.",
      "git_url": "https://github.com/KevinSub/AerialSwift",
      "name": "Aerial Swift"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Created a Linux Cluster Monitoring Agent which is a tool that is used to store each node's hardware specifications as well as its updated memory usage in a database. The technologies used for this project are Bash, Docker, Git, PostgreSQL, and Intellij.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_KevinSubhash/tree/master/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: This is a JDBC application. The JDBC allows a connection between a java application and the RDBMS. In this implementation, CRUD functions were added.",
        "Grep App: This app acts like the grep command in the Linux command line tool. This application recursively searches the files in the directory following a regex pattern and outputs the lines found into a file."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Kevin Subhash",
  "others": [
    {
      "bullets": [
        "Video Games - Developing and playing video games",
        "Music - Creating and listening to music"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed several projects as a front-end and back-end developer by following the scrum/agile methodology. Gained hands-on experience with many technologies such as Java, SQL, Git, and Docker. Held daily scrum meetings as a team lead.",
      "duration": "2022-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "PostgreSQL",
      "Docker",
      "Postman",
      "Maven"
    ],
    "familiar": [
      "HTML/CSS",
      "C",
      "MongoDB",
      "Springboot",
      "UML Diagrams"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate from University of Toronto with an Honours Bachelor of Science. I did a double major in Computer Science and Mathematics during my undergrad. Over the years, I have been exposed to many concepts such as web development, data structures/algorithms, software design, and systems programming just to name a few. I first started programming in grade 10 and found it very fascinating which has led me to pursue a career in computer science. I am currently a software developer at Jarvis where I was introduced to many new technologies such as Docker, Maven, and Springboot. That being said, I see myself as an inspired individual who is committed to professional growth and continuous learning."
}
